      var province = [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33];
      province[0] =['东城区', '西城区', '崇文区', '宣武区', '朝阳区', '丰台区', '石景山区', '海淀区', '门头沟区', '房山区', '通州区', '顺义区', '昌平区', '大兴区',
                         '怀柔区', '平谷区', '密云县', '延庆县'];
      province[1] =['黄浦区', '卢湾区', '徐汇区', '长宁区', '静安区', '普陀区', '闸北区', '虹口区', '杨浦区', '闵行区', '宝山区', '嘉定区', '浦东新区', '金山区', 
                         '松江区', '青浦区', '南汇区', '奉贤区', '崇明县'];
      province[2] =['和平区', '河东区', '河西区', '南开区', '河北区', '红桥区', '塘沽区', '汉沽区', '大港区', '东丽区', '西青区', '津南区', '北辰区', '武清区', '宝坻区',
                         '蓟县', '宁河县', '静海县'];
      province[3] = ['万州区', '黔江区', '涪陵区', '渝中区', '大渡口区', '江北区', '沙坪坝区', '九龙坡区', '南岸区', '北碚区', '渝北区', '巴南区', '长寿区', '江津区', '合川区', '璧山区', '铜梁区', '大足区', '綦江区', '南川区', '永川区',
                     '潼南县', '荣昌县', '梁平县', '城口县', '丰都县', '垫江县', '武隆县', '忠县', '开县', '云阳县', '奉节县', '巫山县', '巫溪县', '石柱土家族自治县', '秀山土家族苗族自治县', '酉阳土家族苗族自治县', '彭水苗族土家族自治县'];
      province[8]=['长春','吉林','四平','辽源','通化','白山','白城','松原','延边朝鲜族自治区','长白山管委会','梅河口','公主岭'];
      province[10] = ['南京市', '无锡市', '徐州市', '常州市', '苏州市', '南通市', '连云港', '淮安市', '盐城市', '扬州市', '镇江市', '泰州市', '宿迁市'];
      province[13] = ['福州市', '厦门市', '莆田市', '三明市', '泉州市', '漳州市', '南平市', '龙岩市', '宁德市'];
      province[0]['东城区'] =['东华门街道', '景山街道','交道口街道', '安定门街道', '北新桥街道', '东四街道', '朝阳门街道','建国门街道', '东直门街道', '和平里街道', '前门街道',
                          '崇文门外街道', '东花市街道', '龙潭街道', '体育馆路街道', '天坛街道', '永定门外街道'];
      province[0]['西城区'] =['西长安街街道', '广安门内街道', '广安门外街道', '新街口街道', '展览路街道', '金融街街道', '什刹海街道', '大栅栏街道', '陶然亭街道', '白纸坊街道',
                         '月坛街道', '德胜街道', '天桥街道', '椿树街道', '牛街街道'];
      province[0]['崇文区'] =['前门街道', '崇文门外街道', '东花市街道', '龙潭街道', '体育馆路街道', '天坛街道', '永定门外街道'];
      province[0]['宣武区'] =['大栅栏街道','天桥街道','椿树街道', '陶然亭街道', '广安门内街道', '牛街街道', '白纸坊街道', '广安门外街道','大栅栏街道'];
      province[0]['朝阳区'] =['朝外街道', '劲松街道', '建外街道', '呼家楼街道', '八里庄街道', '三里屯街道', '团结湖街道', '双井街道', '垡头街道', '左家庄街道', '小关街道', '和平街街道', '酒仙桥街道',
                       '首都机场街道', '潘家园街道', '六里屯街道', '麦子店街道', '香河园街道', '亚运村街道', '奥运村街道', '望京街道','安贞街道', '大屯街道', '东湖街道', '南磨房地区', '高碑店地区',
                       '将台地区', '太阳宫地区', '小红门地区', '十八里店地区', '三间房地区', '东风地区', '常营地区', '管庄地区', '孙河地区', '王四营地区', '东坝地区', '黑庄户地区', '崔各庄地区', 
                       '豆各庄地区', '金盏地区', '平房地区', '来广营地区'];
      province[0]['丰台区'] =['右安门街道', '太平桥街道', '西罗园街道', '大红门街道', '南苑街道', '东高地街道', '东铁匠营街道', '卢沟桥街道', '丰台街道', '新村街道', '长辛店街道',
                         '云岗街道', '方庄地区', '宛平城地区', '马家堡街道', '和义街道', '长辛店镇', '王佐镇', '卢沟桥乡', '花乡乡', '南苑乡'];
      province[0]['石景山区'] = ['八宝山街道', '老山街道', '八角街道', '古城街道', '苹果园街道', '金顶街街道', '广宁街道', '五里坨街道', '鲁谷社区'];
      province[0]['海淀区'] = ['万寿路街道', '羊坊店街道', '甘家口街道', '八里庄街道', '紫竹院街道', '北下关街道', '北太平庄街道', '海淀街道', '中关村街道', '学院路街道', '清河街道',
                               '青龙桥街道', '香山街道', '西三旗街道', '马连洼街道', '花园路街道', '田村路街道', '上地街道', '燕园街道', '清华园街道', '永定路街道', '温泉镇', '上庄镇', '苏家坨镇', '西北旺镇', '四季青镇',
                               '玉渊潭乡', '海淀乡', '东升乡', '万柳地区', '东升地区'];
      province[0]['门头沟区'] = ['大峪街道', '城子街道', '东辛房街道', '大台街道', '龙泉地区', '永定地区', '王平地区', '龙泉镇', '永定镇', '潭柘寺镇', '军庄镇', '王平镇', '雁翅镇', '斋堂镇', '清水镇', '妙峰山镇'];
      province[0]['房山区'] = ['城关街道', '新镇街道', '向阳街道', '东风街道', '迎风街道', '星城街道', '拱辰街道', '西潞街道', '良乡地区', '周口店地区', '琉璃河地区', '阎村镇', '窦店镇', '石楼镇', '长阳镇', '河北镇', '长沟镇', '大石窝镇',
                               '张坊镇', '十渡镇', '青龙湖镇', '韩村河镇', '霞云岭乡', '南窖乡', '佛子庄乡', '大安山乡', '史家营乡', '蒲洼乡'];
      province[0]['通州区'] = ['永顺镇', '梨园镇', '宋庄镇', '漷县镇', '张家湾镇', '马驹桥镇', '西集镇', '永乐店镇', '潞城镇', '台湖镇', '于家务乡', '中仓街道', '新华街道', '玉桥街道', '北苑街道'];
      province[0]['顺义区'] = ['光明街道', '胜利街道', '石园街道', '双丰街道', '旺泉街道', '空港街道', '仁和街道', '张镇', '大孙各庄', '北务', '李遂', '木林', '南彩', '北小营', '李桥', '高丽营', '赵全营', '北石槽', '龙湾屯', '马坡',
                               '南法信', '天竺', '后沙峪', '牛栏山', '杨镇'];
      province[0]['昌平区'] = ['城北街道', '城南街道', '南口地区', '马池口地区', '沙河地区', '回龙观地区', '东小口地区', '南口镇', '马池口镇', '流村镇', '阳坊镇', '十三陵镇', '长陵镇', '南邵镇', '崔村镇', '兴寿镇', '小汤山镇', '百善镇', '沙河镇', '回龙观镇', '东小口镇', '北七家镇'];
      province[0]['大兴区'] = ['黄村镇','西红门','旧宫','亦庄','瀛海','青云店镇','长子营镇','采育镇','礼贤镇','安定镇','榆垡镇','魏善庄镇','庞各庄镇','北臧村','清源街道','兴丰街道','林校路街道','观音寺街道','天宫院街道'];
      province[0]['怀柔区'] = ['怀柔镇', '雁栖镇', '北房镇', '杨宋镇', '庙城镇', '桥梓镇', '怀北镇', '汤河口镇', '渤海镇', '九渡河镇', '琉璃庙镇', '宝山镇', '长哨营满族乡', '喇叭沟门满族乡', '泉河街道', '龙山街道'];
      province[0]['平谷区'] = ['兴谷街道', '滨河街道', '平谷镇', '峪口镇', '马坊镇', '金海湖镇', '东高村镇', '山东庄镇', '南独乐河镇', '大华山镇', '夏各庄镇', '马昌营镇', '王辛庄镇', '大兴庄镇', '刘家店镇', '镇罗营镇', '熊儿寨乡', '黄松峪乡'];
      province[0]['密云县'] = ['密云镇', '溪翁庄镇', '西田各庄镇', '十里堡镇', '河南寨镇', '巨各庄镇', '穆家峪镇', '太师屯镇', '高岭镇', '不老屯镇', '冯家峪镇', '古北口镇', '大城子镇', '东邵渠镇', '北庄镇', '新城子镇', '石城镇', '鼓楼街道', '果园街道', '檀营地区'];
      province[0]['延庆县'] = ['延庆镇','康庄镇','八达岭镇','永宁镇','旧县镇','张山营镇','四海镇','千家店镇','沈家营镇','大榆树镇','井庄镇','刘斌堡乡','大庄科乡','香营乡','珍珠泉乡','百泉街道','香水园街道','儒林街道'];
      province[1]['黄浦区'] = ['南京东路街道', '外滩街道', '半淞园路街道', '小东门街道', '豫园街道', '老西门街道', '瑞金二路街道', '淮海中路街道', '打浦桥街道', '五里桥街道'];
      province[3]['万州区'] = ['柱山乡', '九池乡', '铁峰乡', '黄柏乡', '溪口乡', '燕山乡', '长坪乡', '梨树乡', '普子乡', '地宝乡', '茨竹乡', '恒合土家族乡', '高峰镇', '龙沙镇', '响水镇', '武陵镇', '瀼渡镇', '甘宁镇', '天城镇', '熊家镇',
                               '大周镇', '小周镇', '孙家镇', '高梁镇', '李河镇', '分水镇', '余家镇', '后山镇', '弹子镇', '长岭镇', '新田镇', '走马镇', '白土镇', '长滩镇', '白羊镇', '太安镇', '龙驹镇', '太龙镇', '罗田镇', '新乡镇', '郭村镇', '高笋塘街道', '太白街道',
                               '牌楼街道', '双河口街道', '龙都街道', '周家坝街道', '沙河街道', '钟鼓楼街道', '百安坝街道', '五桥街道', '陈家坝街道'];
      province[8]['长春'] = ['南关区', '朝阳区', '绿园区', '二道区', '双阳区', '宽城区', '九台市', '榆树市', '德惠市', '农安县'];
      province[8]['吉林'] = ['船营区', '龙潭区', '昌邑区', '丰满区', '磐石市', '桦甸市', '蛟河市', '舒兰市', '永吉县'];
      province[8]['四平'] = ['铁西区', '铁东区', '双辽市', '梨树县', '伊通满族自治县'];
      province[8]['辽源'] = ['龙山区', '西安区', '东丰县', '东辽县'];
      province[8]['通化'] = ['东昌区', '二道江区', '集安市', '通化县', '辉南县', '柳河县'];
      province[8]['白山'] = ['浑江区', '江源区', '临江市', '抚松县', '靖宇县', '长白朝鲜族自治县'];
      province[8]['白城'] = ['洮北区', '洮南市', '大安市', '镇赉县', '通榆县'];
      province[8]['松原'] = ['宁江区', '扶余市', '乾安县', '长岭县', '前郭尔罗斯蒙古族自治县'];
      province[8]['延边朝鲜族自治区'] = ['延吉市', '图们市', '敦化市', '和龙市', '珲春市', '龙井市', '汪清县', '安图县'];
      province[8]['长白山管委会'] = ['池北区', '池西区', '池南区'];
      province[8]['梅河口']=['新华街道','解放街道','和平街道','光明街道','福民街道山城镇','红梅镇','海龙镇','新合镇','水道镇','中和镇','黑山头镇','曙光镇','进化镇','牛心顶镇','一座营镇','康大营镇','吉乐乡','李炉乡','杏岭乡','湾龙乡','双兴乡','兴华乡','小杨满族朝鲜族乡'];
      province[8]['公主岭'] = ['河南街道', '河北街道', '东三街道', '岭东街道', '铁北街道', '岭西街道', '苇子沟街道', '刘房子街道', '南崴子街道', '环岭街道', '黑林子镇', '陶家屯镇', '范家屯镇', '响水镇', '大岭镇', '怀德镇', '双城堡镇', '双龙镇', '杨大城子镇', '毛城子镇', '玻璃城子镇', '朝阳坡镇',
                               '大榆树镇', '秦家屯镇', '八屋镇', '十屋镇', '桑树台镇', '二十家子满族镇', '永发乡', '龙山满族乡'];
      province[10]['南京市'] = ['玄武', '白下', '秦淮', '建邺', '鼓楼', '下关', '浦口', '栖霞', '雨花台', '江宁', '六合', '溧水', '高淳'];
      province[10]['无锡市'] = ['崇安', '南长', '北塘', '滨湖', '锡山', '惠山', '江阴', '宜兴'];
      province[10]['徐州市'] = ['云龙', '鼓楼', '九里', '贾汪', '泉山', '新沂', '邳州', '丰县', '沛县', '铜山', '睢宁'];
      province[10]['常州市'] = ['钟楼', '天宁', '戚墅堰', '新北', '武进', '溧阳', '金坛'];
      province[10]['苏州市'] = ['金阊', '沧浪', '平江', '虎丘', '吴中', '相城', '常熟', '张家港', '昆山', '吴江', '太仓'];
      province[10]['南通市'] = ['崇川', '港闸', '启东', '如皋', '通州', '海门', '海安', '如东'];
      province[10]['连云港'] = ['新浦', '连云', '海州', '赣榆', '东海', '灌云', '灌南'];
      province[10]['淮安市'] = ['清河', '青浦', '楚州', '淮阴', '涟水', '洪泽', '盱眙', '金湖'];
      province[10]['盐城市'] = ['亭湖', '盐都', '东台', '大丰', '响水', '滨海', '阜宁', '射阳', '建湖'];
      province[10]['扬州市'] = ['广陵', '邗江', '淮扬区', '仪征', '高邮', '江都', '宝应'];
      province[10]['镇江市'] = ['京口', '润州', '丹徒', '丹阳', '扬中', '句容'];
      province[10]['泰州市'] = ['海陵', '高港', '兴化', '靖江', '泰兴', '姜堰'];
      province[10]['宿迁市'] = ['宿城', '宿豫', '沭阳', '泗阳', '泗洪'];
      province[13]['福州市'] = ['鼓楼区', '台江区', '仓山区', '马尾区', '晋安区', '闽侯县', '连江县', '罗源县', '闽清县', '永泰县', '平潭县', '福清市', '长乐市'];
      province[13]['厦门市'] = ['思明区', '海沧区', '湖里区', '集美区', '同安区', '翔安区'];
      province[13]['莆田市'] = ['城厢区', '涵江区', '荔城区', '秀屿区', '仙游县'];
      province[13]['三明市'] = ['梅列区', '三元区', '明溪县', '清流县', '宁化县', '大田县', '尤溪县', '沙县', '将乐县', '泰宁县', '建宁县', '永安市'];
      province[13]['泉州市'] = ['鲤城区', '丰泽区', '洛江区', '泉港区', '惠安县', '安溪县', '永春县', '德化县', '金门县', '石狮市', '晋江市', '南安市'];
      province[13]['漳州市'] = ['芗城区', '龙文区', '云霄县', '漳浦县', '诏安县', '长泰县', '东山县', '南靖县', '平和县', '华安县', '龙海市'];
      province[13]['南平市'] = ['延平区', '顺昌县', '浦城县', '光泽县', '松溪县', '政和县', '邵武市', '武夷山', '建瓯市', '建阳市'];
      province[13]['龙岩市'] = ['新罗区', '长汀县', '永定县', '上杭县', '武平县', '连城县', '漳平市'];
      province[13]['宁德市'] = ['蕉城区', '霞浦县', '古田县', '屏南县', '寿宁县', '周宁县', '柘荣县', '福安市', '福鼎市'];

      
      function setCity(value) {
          var city = document.getElementById("area");
          city.options.length = 0;
          for (var i = 0; i < province[value].length; i++) {
              var opt = document.createElement("OPTION");
              opt.text = province[value][i];
              opt.value = province[value][i];
              city.options.add(opt);
          }
          setCounty(province[value][0]);
      }

      function setCounty(value) {
          var cou = document.getElementById("county");
          var pro = document.getElementById("pro").value;
          cou.options.length = 0;
          for (var i = 0; i < province[pro][value].length; i++) {
              var opt = document.createElement("OPTION");
              opt.text = province[pro][value][i];
              opt.value = province[pro][value][i];
              cou.options.add(opt);
          }
      }